{"keras_version": "2.3.1", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "padding": "valid", "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "padding": "valid", "bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 128, "padding": "valid", "bias_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 128, "padding": "valid", "bias_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 256, "padding": "valid", "bias_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 256, "padding": "valid", "bias_constraint": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "use_bias": true, "units": 2048, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "dense_2", "activation": "relu", "use_bias": true, "units": 1024, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "dense_3", "activation": "relu", "use_bias": true, "units": 512, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_5", "noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "dense_4", "activation": "softmax", "use_bias": true, "units": 7, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "backend": "tensorflow"}