{"config": {"layers": [{"config": {"name": "conv2d_1", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 100, 100, 1], "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 128, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "dtype": "float32", "scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "name": "batch_normalization_1"}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 2048, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1024, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 512, "use_bias": true, "activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 2, "use_bias": true, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_4", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1"}