{"config": {"name": "sequential_1", "layers": [{"config": {"bias_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 48, 48, 1], "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_1", "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"units": 2048, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 1024, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 512, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense_3", "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 7, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense_4", "kernel_constraint": null, "use_bias": true, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1"}